<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.1Password</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>1Password</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array />
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>1Password is a password manager that goes beyond simple password storage by integrating directly with your web browser to automatically log you into websites, enter credit card information, fill registration forms, and easily generate strong passwords.</string>
			<key>developer</key>
			<string>AgileBits Inc.</string>
			<key>display_name</key>
			<string>1Password</string>
			<key>minimum_os_version</key>
			<string>10.12</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>preinstall_script</key>
			<string>#!/bin/sh
export PATH=/usr/bin:/bin:/usr/sbin:/sbin

APP_NAME="1Password 7"
BUNDLE_ID="com.agilebits.onepassword7"

CONSOLEUSER=$(who | grep console | cut -d" " -f1)
if [ "$CONSOLEUSER" != "" ] ; then
	# is the console user running the app and is it in front?
	FRONT_APPID=$(lsappinfo info -only bundleid $(lsappinfo front) | cut -d= -f2 | cut -d\" -f2)
	if [ "$FRONT_APPID" == "$BUNDLE_ID" ] ; then
			# leave a flag that tells us to relaunch and bring to front
			echo "frontmost" &gt;&gt; /tmp/"$BUNDLE_ID"_relaunch
	else
			# is the console user running the app at all?
			killall -u "$CONSOLEUSER" "$APP_NAME" &amp;&gt;/dev/null
			if [ $? -eq 0 ] ; then
					# leave a flag that tells us to relaunch and not bring to front
					echo "not frontmost" &gt;&gt; /tmp/"$BUNDLE_ID"_relaunch
			fi
	fi
fi
# kill all instances of app
killall "$APP_NAME" &amp;&gt;/dev/null
exit 0
</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
export PATH=/usr/bin:/bin:/usr/sbin:/sbin

APP="/Applications/1Password 7.app"
BUNDLE_ID="com.agilebits.onepassword7"

if [ -e /tmp/"$BUNDLE_ID"_relaunch ] ; then
	FRONTMOST=$(cat /tmp/"$BUNDLE_ID"_relaunch)
	rm /tmp/"$BUNDLE_ID"_relaunch
	if [ "$FRONTMOST" == "frontmost" ] ; then
			OPENCMD="open -a"
	else
			OPENCMD="open -g -a"
	fi
	CONSOLEUSER=$(who | grep console | cut -d" " -f1)
	if [ "$CONSOLEUSER" == "" ] ; then
			exit 0
	fi
	CONSOLE_UID=$(id -u "$CONSOLEUSER")
	os_major_version=$(sw_vers -productVersion | cut -d. -f2)
	for pid_uid in $(ps -axo pid,uid,args | grep -i "[l]oginwindow.app" | awk '{print $1 "," $2}'); do
			pid=$(echo $pid_uid | cut -d, -f1)
			uid=$(echo $pid_uid | cut -d, -f2)
			if [ "$uid" == "$CONSOLE_UID" ] ; then
					if [[ $os_major_version -lt 10 ]] ; then
							launchctl bsexec "$pid" chroot -u "$uid" / $OPENCMD "$APP"
							exit 0
					else
							launchctl asuser "$uid" $OPENCMD "$APP"
							exit 0
					fi
			fi
	done
fi
</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.1Password</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>io.github.hjuutilainen.download.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>dfc3143e9230d6d31c5707202b870d93ca1b6c8c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/1Password.download.recipe</string>
				<key>sha256_hash</key>
				<string>7941aab20fdb6a545c6db43e264aab424c6f30d2dd934b359c7ba8ed392d110a</string>
			</dict>
			<key>io.github.hjuutilainen.munki.1Password</key>
			<dict>
				<key>git_hash</key>
				<string>dfc3143e9230d6d31c5707202b870d93ca1b6c8c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/1Password.munki.recipe</string>
				<key>sha256_hash</key>
				<string>d3d86d8533c0fa1bf34a8c10f041313d0d2ef5225cb791e17328b3227702f3ff</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
