<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>English</string>
		<key>MAJOR_VERSION</key>
		<string>AcrobatDC</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/adobe</string>
		<key>NAME</key>
		<string>AdobeReaderDC</string>
		<key>OS_VERSION</key>
		<string>10.12.0</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Reader.app</string>
				<string>Adobe Acrobat Reader DC.app</string>
				<string>Adobe Acrobat Pro.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>More powerful than other PDF software, Adobe Acrobat Reader DC is the free, trusted standard for viewing, printing, and annotating PDFs. And now, it’s connected to Adobe Document Cloud — so it’s easier than ever to work with PDFs on computers and mobile devices.</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Acrobat Reader DC</string>
			<key>minimum_os_version</key>
			<string>10.12.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
			<string>#!/bin/sh
if [ -e "/Applications/Adobe Acrobat Reader DC.app" ]; then
rm -r "/Applications/Adobe Acrobat Reader DC.app"
fi
exit 0
            </string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.AdobeReaderDC</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>AdobeReaderURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>e59fe2695de28cbacc77d8ec23f68fee24e1b135</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderURLProvider.py</string>
				<key>sha256_hash</key>
				<string>647d2b53c5950cc94c30cfa9a3c4061e5663661193fb117125a6edcec7796e7c</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.AdobeReaderDC</key>
			<dict>
				<key>git_hash</key>
				<string>cd4c7a76dc2040ecc1a7c08c4a56ba849f71cfb7</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderDC.download.recipe</string>
				<key>sha256_hash</key>
				<string>5d540d866069d66e67ef11a825f9feaff8500e6c45aa520393e542ab546e3843</string>
			</dict>
			<key>com.github.autopkg.munki.AdobeReaderDC</key>
			<dict>
				<key>git_hash</key>
				<string>e6099c55261ae5bc78f773f9c417c280b3657f34</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderDC.munki.recipe</string>
				<key>sha256_hash</key>
				<string>e57974268d396c884ba267a06143cbf0586760754cb6456a640d76fb97faf196</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
