<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Aspera Connect</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Aspera Connect</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>File Sharing</string>
			<key>description</key>
			<string>Push the limits of maximum-speed transfers. Aspera Connect helps you securely move files and folders of any size.</string>
			<key>developer</key>
			<string>IBM Corp</string>
			<key>display_name</key>
			<string>Aspera Connect</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Aspera Connect</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.download.Aspera Connect</key>
			<dict>
				<key>git_hash</key>
				<string>afe57214899fa67d181abe1f15f74470b84b0abd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Aspera Connect/Aspera Connect.download.recipe</string>
				<key>sha256_hash</key>
				<string>4a034687e424eb45b9def054354750fad8fd95406176d567a343dbe1409ea80c</string>
			</dict>
			<key>com.github.dataJAR-recipes.munki.Aspera Connect</key>
			<dict>
				<key>git_hash</key>
				<string>afe57214899fa67d181abe1f15f74470b84b0abd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Aspera Connect/Aspera Connect.munki.recipe</string>
				<key>sha256_hash</key>
				<string>875d84f85a7f23e4e88a2cd45dcda79f14d000b6d5015ea5792fbef47de5faf5</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
