<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.BoxSync</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/box</string>
		<key>NAME</key>
		<string>Box Sync</string>
		<key>URL</key>
		<string>https://community.box.com/t5/Using-Box-Sync/Installing-Box-Sync/ta-p/85</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>File Sharing</string>
			<key>description</key>
			<string>Box – the single, secure solution for content access, sharing and collaboration – lets you replace a myriad of file transfer systems and unsecured, consumer-focused tools like YouSendIt and Dropbox. Bottom line: You reduce content silos, lower costs and give users the simplicity and functionality they want with the security IT requires.</string>
			<key>developer</key>
			<string>Box</string>
			<key>display_name</key>
			<string>Box Sync</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Install the helper tool so there is no prompt for Admin Credentials
# Matt Hansen 03-05-2014
/bin/cp -f "/Applications/Box Sync.app/Contents/Resources/com.box.sync.bootstrapper" /Library/PrivilegedHelperTools/com.box.sync.bootstrapper
/bin/cp -f "/Applications/Box Sync.app/Contents/Resources/com.box.sync.iconhelper" /Library/PrivilegedHelperTools/com.box.sync.iconhelper

/usr/sbin/chown root:wheel /Library/PrivilegedHelperTools/com.box.sync.bootstrapper /Library/PrivilegedHelperTools/com.box.sync.iconhelper
/bin/chmod 4755 /Library/PrivilegedHelperTools/com.box.sync.bootstrapper /Library/PrivilegedHelperTools/com.box.sync.iconhelper
            </string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
# Remove the helper tools installed by the postinstall_script
# Greg Neagle 12-01-2016
/bin/rm -f /Library/PrivilegedHelperTools/com.box.sync.bootstrapper
/bin/rm -f /Library/PrivilegedHelperTools/com.box.sync.iconhelper
            </string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.joshua-d-miller.autopkg.munki.boxsync</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.hansen-m.download.boxsync</key>
			<dict>
				<key>git_hash</key>
				<string>ef4790908ea1df5fe2ecec23df67bd4810721e92</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Box/BoxSync.download.recipe</string>
				<key>sha256_hash</key>
				<string>9d0c4e5aba9b71fb39735aeab4f1fe658dfaa148b83bc81f6dbc78374ec73929</string>
			</dict>
			<key>com.github.joshua-d-miller.autopkg.munki.boxsync</key>
			<dict>
				<key>git_hash</key>
				<string>7716b2288f3221fcae56f28f49ec91ec69f6e930</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.joshua-d-miller-recipes/Box/BoxSync.munki.recipe</string>
				<key>sha256_hash</key>
				<string>d87c9a028e3b93f5173e1595e5da7dbe31711bb71e18aefdba23162f8608db40</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
