<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Cisco Webex Meetings</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.cisco.webexmeetingsapp</string>
		<key>DOWNLOAD_URL</key>
		<string>https://akamaicdn.webex.com/client/webexapp.dmg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Cisco Webex Meetings</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Cisco Webex Meetings.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string></string>
			<key>developer</key>
			<string>Cisco</string>
			<key>category</key>
			<string>Communication</string>
			<key>display_name</key>
			<string>Cisco Webex Meetings</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.CiscoWebexMeetings</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.download.CiscoWebexMeetings</key>
			<dict>
				<key>git_hash</key>
				<string>14fa3d6457ffb9958e6fa423fe213c6125826edf</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Cisco Webex Meetings/Cisco Webex Meetings.download.recipe</string>
				<key>sha256_hash</key>
				<string>e260346e953af89a13efbd7189c871971e704b2a2962769a896f7b2fc4e4bb82</string>
			</dict>
			<key>com.github.dataJAR-recipes.munki.CiscoWebexMeetings</key>
			<dict>
				<key>git_hash</key>
				<string>67ec49a5209ba8c707c2ca47833cba4ceb265235</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Cisco Webex Meetings/Cisco Webex Meetings.munki.recipe</string>
				<key>sha256_hash</key>
				<string>905264fedcc571dc7cc0c1e473fa860fdc1a2dc471bb6b282e700dae28f759a9</string>
			</dict>
			<key>com.github.dataJAR-recipes.pkg.CiscoWebexMeetings</key>
			<dict>
				<key>git_hash</key>
				<string>67ec49a5209ba8c707c2ca47833cba4ceb265235</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Cisco Webex Meetings/Cisco Webex Meetings.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>acc87c485c8257315ea9412fdf66e2e9e5714805ae8c62623a2bd3ebaca82a05</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
