<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Evernote</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Evernote</string>
		<key>NAME</key>
		<string>Evernote</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://update.evernote.com/public/ENMacSMD/EvernoteMacUpdate.xml</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Evernote makes it easy to remember things big and small from your everyday life using your computer, phone, tablet and the web.</string>
			<key>display_name</key>
			<string>Evernote</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Evernote</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.Evernote</key>
			<dict>
				<key>git_hash</key>
				<string>52e7c5a76ce386397cebd7bd80d11bcac59cd2cd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Evernote/Evernote.download.recipe</string>
				<key>sha256_hash</key>
				<string>55fc82c29fdb651218dc809fd7b1a3b28c30541256a6cf09ed83b2fc447dc50c</string>
			</dict>
			<key>com.github.autopkg.munki.Evernote</key>
			<dict>
				<key>git_hash</key>
				<string>52e7c5a76ce386397cebd7bd80d11bcac59cd2cd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Evernote/Evernote.munki.recipe</string>
				<key>sha256_hash</key>
				<string>61b4c0d3571ae51887ff4e395f1dbf92824c634915bbd2241f07f5ecfc68e109</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
