<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.GoogleEarth</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/earth/client/advanced/current/GoogleEarthMacNoUpdate-Intel.dmg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/google/%NAME%</string>
		<key>NAME</key>
		<string>GoogleEarth</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<true/>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Maps</string>
			<key>description</key>
			<string>Take a virtual journey to any location in the world. Explore 3D buildings, imagery, and terrain. Find cities, places and local businesses.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Earth</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-earth</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.google-earth</key>
			<dict>
				<key>git_hash</key>
				<string>dee6692f2d2a8709fa325a96208ccb37ac31666a</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleEarth/GoogleEarth.download.recipe</string>
				<key>sha256_hash</key>
				<string>22f171bdb25954fb975b047319460de71416ed6da45db923417b8b05ba58d6a1</string>
			</dict>
			<key>com.github.autopkg.munki.google-earth</key>
			<dict>
				<key>git_hash</key>
				<string>dee6692f2d2a8709fa325a96208ccb37ac31666a</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleEarth/GoogleEarth.munki.recipe</string>
				<key>sha256_hash</key>
				<string>2e309e80e976df2c63d27a0d47e917ba2afef681975a53957a21268e6421efc9</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
