<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.HoudahSpot</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>HoudahSpot</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://www.houdah.com/houdahSpot/updates/cast4.xml</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Advanced file-search tool.</string>
			<key>developer</key>
			<string>Houdah Software s.a r.l.</string>
			<key>category</key>
			<string>Utilities</string>
			<key>display_name</key>
			<string>HoudahSpot</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.HoudahSpot</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.HoudahSpot</key>
			<dict>
				<key>git_hash</key>
				<string>8a011dfd74579a361268b4c6d5cd07e7e9166b9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Houdah/HoudahSpot.download.recipe</string>
				<key>sha256_hash</key>
				<string>a84d7a90d4d06b32c0b9f46162e44a3dbca59423b3ab9233588d2525cba5afff</string>
			</dict>
			<key>com.github.homebysix.munki.HoudahSpot</key>
			<dict>
				<key>git_hash</key>
				<string>8a011dfd74579a361268b4c6d5cd07e7e9166b9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Houdah/HoudahSpot.munki.recipe</string>
				<key>sha256_hash</key>
				<string>6493ea607381d676cb876f91cace0e983c222c7ccf4c5bf9cad36dc8d19aa4d5</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
