<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.RingCentralPhone</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://downloads.ringcentral.com/sp/RingCentralForMac</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/ringcentral</string>
		<key>NAME</key>
		<string>RingCentral Phone</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Communication</string>
			<key>description</key>
			<string>The RingCentral Phone is an easy-to-use app, and a comprehensive communications hub with an all-inclusive phone, fax, business SMS, and conferencing for your desktop. It provides an intuitive interface that optimizes the user experience and increases productivity.</string>
			<key>display_name</key>
			<string>RingCentral Phone</string>
			<key>minimum_os_version</key>
			<string>10.13</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.bradclare.munki.ringcentralphone</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.bradclare.download.ringcentralphone</key>
			<dict>
				<key>git_hash</key>
				<string>d3f5a873d546bec034346d27a410e927dfde5b7e</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.bradclare-recipes/RingCentral/RingCentralPhone.download.recipe</string>
				<key>sha256_hash</key>
				<string>037611da8405c555c89a269bad3de2f396c82a63ad8fa0cc0950566976e20e5c</string>
			</dict>
			<key>com.github.bradclare.munki.ringcentralphone</key>
			<dict>
				<key>git_hash</key>
				<string>d3f5a873d546bec034346d27a410e927dfde5b7e</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.bradclare-recipes/RingCentral/RingCentralPhone.munki.recipe</string>
				<key>sha256_hash</key>
				<string>0476c49e902869ba450454e9fa882ac7601892b793a9cf8baa9aa0da86661177</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
