<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.VLC</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>VLC</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Video</string>
			<key>description</key>
			<string>VLC is a free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVD, Audio CD, VCD, and various streaming protocols.</string>
			<key>display_name</key>
			<string>VLC Media Player</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>x86_64</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.VLC</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.VLC</key>
			<dict>
				<key>git_hash</key>
				<string>72aaf497ded4fd743905da2a5383a0a990067d39</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/VLC/VLC.download.recipe</string>
				<key>sha256_hash</key>
				<string>726256d1486e993b9ce49f292be6b3ffe14a51a3a2bb31d8a7c2e355428a1ad4</string>
			</dict>
			<key>com.github.autopkg.munki.VLC</key>
			<dict>
				<key>git_hash</key>
				<string>37fe16ce9cc765bddba74fb6abc474b6e1eeaa83</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/VLC/VLC.munki.recipe</string>
				<key>sha256_hash</key>
				<string>ba51394e291074d2a4bb89d7138705e6824a4268f1ca18949e27de59cb491508</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
